Revit 2027 API
IFCAggregate.AddAggregate Method
 Creates a nested aggregate and adds it to the aggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAggregate AddAggregate()
Public Function AddAggregate As IFCAggregate
public:
IFCAggregate^ AddAggregate()
member AddAggregate : unit -> IFCAggregate
Return Value
IFCAggregate
 The nested aggregate.
Exceptions
Exception | Condition
InvalidOperationException |  The aggregate is not valid.
See Also
Reference
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace